wiki/2016-07-22-mysql-user.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>MySQL user</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">MySQL user</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#mysql"><div class="category">mysql</div></a> </div>
<div class="char-counter">2016-07-22</div>
        <div id="content">

<div id="outline-container-org7f02e0d" class="outline-2">
<h2 id="org7f02e0d">MySQL的用户管理</h2>
<div class="outline-text-2" id="text-org7f02e0d">
<p>
MySQL的用户信息都保存在数据库mysql的user表中，因此MySQL的用户操作实际上就是对
 mysql.user表的增删查改的操作,下图中展示了mysql.user的表结构：
</p>

<p>
从图中可以看到，在该表中可以设置用户的所有信息，包括用户名，密码，权限等等。
Notice:password字段是通过PASSWORD('')函数生成的。除了修改user表的方式来操作MySQL
用户外，MySQL有一些额外的命令用于创建或删除MySQL用户。
</p>
</div>
</div>

<div id="outline-container-orge60e238" class="outline-2">
<h2 id="orge60e238">创建用户</h2>
<div class="outline-text-2" id="text-orge60e238">
</div>
<div id="outline-container-org34405e3" class="outline-3">
<h3 id="org34405e3">CREATE USER创建无权限用户</h3>
<div class="outline-text-3" id="text-org34405e3">
<p class="verse">
语法：<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;CREATE USER user [IDENTIFIED BY [PASSWORD] 'password'][, user [IDENTIFIED BY [PASSWORD] 'password']] ...<br>
<br>
示例：<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;create user test@localhost identified by 'test';//创建一个用户名为test,密码为test的用户，该用户没有任何权限<br>
<br>
<br>
</p>
</div>
</div>

<div id="outline-container-org387c3a0" class="outline-3">
<h3 id="org387c3a0">GRANT方式创建带权限用户</h3>
<div class="outline-text-3" id="text-org387c3a0">
<p class="verse">
语法：<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;GRANT [ALL | [SELECT,DELETE...]] PRIVILEGES ON {databasename|*}.{tablename|*}... TO username IDENTIFIED BY password;<br>
<br>
示例：<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;GRANT ALL PRIVILEGES ON <b>.</b> TO test@% IDENTIFIED BY 'test';<br>
<br>
</p>
</div>
</div>
<div id="outline-container-orgcf990b2" class="outline-3">
<h3 id="orgcf990b2">删除用户</h3>
<div class="outline-text-3" id="text-orgcf990b2">
<p class="verse">
语法：<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;DROP USER username;//username指的是带host的username，即test@localhost，如果不指定host，host就为%.<br>
<br>
示例：<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;DROP USER test@localhost;<br>
<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org901b216" class="outline-2">
<h2 id="org901b216">MySQL权限说明</h2>
<div class="outline-text-2" id="text-org901b216">
</div>
<div id="outline-container-org803e69a" class="outline-3">
<h3 id="org803e69a">查看某个用户的权限</h3>
<div class="outline-text-3" id="text-org803e69a">
<pre class="example">
mysql&gt; show grants for root@localhost;

</pre>
</div>
</div>
<div id="outline-container-orgd53b6a8" class="outline-3">
<h3 id="orgd53b6a8">各权限解释</h3>
<div class="outline-text-3" id="text-orgd53b6a8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
  <colgroup>
    <col  class="org-left" />
    <col  class="org-left" />
    <col  class="org-left" />
  </colgroup>
  <thead>
    <tr>
      <th scope="col" class="org-left">权限</th>
      <th scope="col" class="org-left">列</th>
      <th scope="col" class="org-left">说明</th>
    </tr>
  </thead>

  <tbody>
    <tr>
      <td class="org-left">CREATE</td>
      <td class="org-left">`Create_priv`</td>
      <td class="org-left">创建数据库和表</td>
    </tr>


    <tr>
      <td class="org-left">DROP</td>
      <td class="org-left">`Drop_priv`</td>
      <td class="org-left">抛弃(删除)数据库和表</td>
    </tr>


    <tr>
      <td class="org-left">GRANT OPTION</td>
      <td class="org-left">`Grant_priv`</td>
      <td class="org-left">数据库、表或保存的程序</td>
    </tr>


    <tr>
      <td class="org-left">REFERENCES</td>
      <td class="org-left">`References_priv`</td>
      <td class="org-left">未使用</td>
    </tr>


    <tr>
      <td class="org-left">ALTER</td>
      <td class="org-left">`Alter_priv`</td>
      <td class="org-left">修改表和索引</td>
    </tr>


    <tr>
      <td class="org-left">DELETE</td>
      <td class="org-left">`Delete_priv`</td>
      <td class="org-left">表</td>
    </tr>


    <tr>
      <td class="org-left">INDEX</td>
      <td class="org-left">`Index_priv`</td>
      <td class="org-left">创建或抛弃索引</td>
    </tr>


    <tr>
      <td class="org-left">INSERT</td>
      <td class="org-left">`Insert_priv`</td>
      <td class="org-left">向表中插入新行</td>
    </tr>


    <tr>
      <td class="org-left">SELECT</td>
      <td class="org-left">`Select_priv`</td>
      <td class="org-left">检索表中的记录</td>
    </tr>


    <tr>
      <td class="org-left">UPDATE</td>
      <td class="org-left">`Update_priv`</td>
      <td class="org-left">修改现存表记录</td>
    </tr>


    <tr>
      <td class="org-left">CREATE VIEW</td>
      <td class="org-left">`Create_view_priv`</td>
      <td class="org-left">视图</td>
    </tr>


    <tr>
      <td class="org-left">SHOW VIEW</td>
      <td class="org-left">`Show_view_priv`</td>
      <td class="org-left">视图</td>
    </tr>


    <tr>
      <td class="org-left">ALTER ROUTINE</td>
      <td class="org-left">`Alter_routine_priv`</td>
      <td class="org-left">保存的程序</td>
    </tr>


    <tr>
      <td class="org-left">CREATE ROUTINE</td>
      <td class="org-left">`Create_routine_priv`</td>
      <td class="org-left">保存的程序</td>
    </tr>


    <tr>
      <td class="org-left">EXECUTE</td>
      <td class="org-left">`Execute_priv`</td>
      <td class="org-left">保存的程序</td>
    </tr>


    <tr>
      <td class="org-left">FILE</td>
      <td class="org-left">`File_priv`</td>
      <td class="org-left">读或写服务器上的文件</td>
    </tr>


    <tr>
      <td class="org-left">CREATE TEMPORARY TABLES</td>
      <td class="org-left">`Create_tmp_table_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>


    <tr>
      <td class="org-left">LOCK TABLES</td>
      <td class="org-left">`Lock_tables_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>


    <tr>
      <td class="org-left">CREATE USER</td>
      <td class="org-left">`Create_user_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>


    <tr>
      <td class="org-left">PROCESS</td>
      <td class="org-left">`Process_priv`</td>
      <td class="org-left">查看服务器中执行的线程信息或杀死线程</td>
    </tr>


    <tr>
      <td class="org-left">RELOAD</td>
      <td class="org-left">`Reload_priv`</td>
      <td class="org-left">重载授权表或清空日志、主机缓存或表缓存</td>
    </tr>


    <tr>
      <td class="org-left">REPLICATION CLIENT</td>
      <td class="org-left">`Repl_client_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>


    <tr>
      <td class="org-left">REPLICATION SLAVE</td>
      <td class="org-left">`Repl_slave_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>


    <tr>
      <td class="org-left">SHOW DATABASES</td>
      <td class="org-left">`Show_db_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>


    <tr>
      <td class="org-left">SHUTDOWN</td>
      <td class="org-left">`Shutdown_priv`</td>
      <td class="org-left">关闭服务器</td>
    </tr>


    <tr>
      <td class="org-left">SUPER</td>
      <td class="org-left">`Super_priv`</td>
      <td class="org-left">服务器管理</td>
    </tr>
  </tbody>
</table>
</div>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
